In [1]:
import pandas as pd
import numpy as np

In [2]:
city_temps = pd.DataFrame({'Tulsa':[78.5,80.0,75.1,np.nan, np.nan],
                          'Dallas': [89.5,92.3,np.nan,np.nan,95.0]},
                         index=['Mon','Tue','Wed','Thu','Fri'])
city_temps

     Tulsa  Dallas
Mon   78.5    89.5
Tue   80.0    92.3
Wed   75.1     NaN
Thu    NaN     NaN
Fri    NaN    95.0

In [3]:
city_temps.fillna(80.0)

     Tulsa  Dallas
Mon   78.5    89.5
Tue   80.0    92.3
Wed   75.1    80.0
Thu   80.0    80.0
Fri   80.0    95.0

In [4]:
city_temps.fillna({'Tulsa': np.round(np.mean(city_temps['Tulsa']),2),
                  'Dallas': np.round(np.mean(city_temps['Dallas']),2)})

     Tulsa  Dallas
Mon  78.50   89.50
Tue  80.00   92.30
Wed  75.10   92.27
Thu  77.87   92.27
Fri  77.87   95.00

In [7]:
np.round(np.mean(city_temps['Tulsa']),2)

77.87